'''
Вам требуется написать программу, которая запрашивает у пользователя
длины двух катетов и выводит площадь треугольника.
'''

a = int(input('Введите длину первого катета: '))
b = int(input('Введите длину второго катета: '))
print((a*b)/2)