# Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt.
# Фамилия, имя, отчество, номер телефона - данные, которые должны находиться в файле.
# 1) Программа должна выводить данные
# 2) Программа должна сохранять данные в текстовом файле
# 3) Пользователь может ввести одну из характеристик для поиска определенной записи
# (Например имя или фамилию человека)
# 4) Использование функций. Ваша программа не должна быть линейной

# Этапы работы:
# 1) Создать телефонный справочник:
# - Открыть файл в режиме добавления (a)
# 2) Добавить контакт:
# - Запросить информацию у пользователя
# - Подготовить данные в необходимом формате
# - Открыть файл в режиме добавления (a)
# - Добавить контакт в файл
# 3) Вывести данные из файла на экран:
# - Открыть файл в режиме чтения (r)
# - Вывести информацию на экран
# 4) Поиск данных:
# - Запросить вариант поиска
# - Запросить данные поиска
# - Открыть файл в режиме чтения (r)
# - Осуществить поиск по файлу
# - Вывести нужную информацию на экран
# 5) Реализовать UI:
# - Вывести варианты меню
# - Получение запроса пользователя
# - Реализация запроса пользователя
# - Выход из программы