'''
Напишите функцию calc_income_by_year, которая принимает список с
датами и список с выручкой, а возвращает словарь, где ключи — это года, а
значения — это выручка за соответствующие года. Используйте аннотирование
типов.
Пример:
print(calc_income_by_year(['2021-11-01', '2021-12-15', '2020-11-30'], [100, 200,
150]))
На выходе: {'2021': 300, '2020': 150}
'''




def calc_income_by_year(dates: list, income: list) -> dict:
    """
    :param dates: список с датами
    :param income: список с выручкой
    :return: словарь, где ключи — это года, а значения — это выручка за соответствующие года

    >>> print(calc_income_by_year(['2021-11-01', '2021-12-15', '2020-11-30'], [100, 200, 150]))
    {'2021': 300, '2020': 150}
    >>> print(calc_income_by_year(['2020-03-28', '2020-04-24', '2020-09-03'], [100, 200, 200]))
    {'2020': 500}
    """

    income_by_year = dict()
    for date, inc in zip(dates, income):
        year = date.split('-')[0]
        income_by_year[year] = income_by_year.get(year, 0) + inc

    return income_by_year


if __name__ == '__main__':
    print(calc_income_by_year(
        ['2021-11-01', '2021-12-15', '2020-11-30'],
        [100, 200, 150]))
    print(calc_income_by_year(
        ['2020-03-28', '2020-04-24', '2020-09-03'],
        [100, 200, 200]))